# Программа отбирающая файлы с датой позже чем заданная
import os

# Запрос исходных данных: путь к корневой папке и дата после которой
# были созданы файлы
path = input("Введите путь к иследуемой папке с файлами: ")
date_file = input("Дата последних изменений файлов: ")
# Получаем перечень всех файло и папок

# Проходим по всем файлам каждой папки

# дата создания позже заданой даты

# Если да, то сохраняем в файл с путем от корневой паки проекта

# Если нет проверяем следующий файл

# Если папки и файлы закончились, выдаем сообщение об окончании